# BASE MESSAGES
TITLE = "Конвертор изображений"
DOWNLOAD_IMAGE = "Загрузите свою картинку"
IMAGE_READ_BUTTON = "Считать текст с картинки"
CHOOSE_MODE = "Режим работы:"
CHOOSE_MODE_DESCRIPTION = ("По умолчанию включен режим GPU (Самый производительный из режимов).\n"
                           "Если у вас возникает ошибка нехватки памяти, попробуйте изменить режим на CPU")
CHOOSE_LANGUAGES = "Выберите языки используемые в изображении"
LOADING = "Загрузка..."
RESULT = "Результат:"
IGNORE_CASE_RESULT = "Результат без учета регистра:"

# ERROR MESSAGES
NOT_FOUND_IMAGE_ERROR = "Для считывания текста с картинки необходимо загрузить саму картинку"
NOT_FOUND_LANGUAGES = "Не выбраны языки для изображения"
TEXT_NOT_DETECTED_ERROR = "Текст не распознан. Попробуйте изменить язык и повторить запрос"
OUT_OF_MEMORY_ERROR = "Ошибка нехватки памяти у GPU устройства. Попробуйте изменить режим на CPU и повторить запрос"
